<!DOCTYPE doctype PUBLIC "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
                
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
                
  <meta name="GENERATOR"
 content="Mozilla/4.76 [en] (X11; U; Linux 2.2.18pre21 i686) [Netscape]">
                
  <meta name="CREATED" content="20001012;22191900">
                
  <meta name="CHANGEDBY" content="Victor Gonzalez-Barbone">
                
  <meta name="CHANGED" content="20001013;10371600">
  <title>Curso B&aacute;sico de UNIX</title>
                          
  <style>
	<!--
		@page { margin-left: 2.3cm; margin-right: 2.3cm; margin-top: 1.5cm; margin-bottom: 1.5cm }
	-->
	</style>
</head>
  <body bgcolor="#ffffff">
        
<address> Centro de Inform&aacute;tica. Sistemas Operativos II. Curso 2002, 
 1er. semestre.<br>
 </address>
       
<hr>    
<center>    
<h2> Prueba parcial 1/2</h2>
   </center>
        
<center>    
<h4> <b>Sin consulta de material.<br>
    Total: 50 puntos.</b></h4>
   </center>
        
<h4> Responder brevemente las siguientes preguntas (14 puntos):&nbsp;   
</h4>
   
<ol>
    <li>&iquest;Qu&eacute; es el UID? &iquest;Qu&eacute; es el GID? &iquest;Qu&eacute;
 comando muestra el UID y el GID de un usuario? (4p).</li>
    <li>Diferenciar los caracteres "|", "\", "/" y ";" en el shell, indicando 
  para qu&eacute; se usa cada uno (4p). <br>
    </li>
    <li>El archivo /var/spool/mail es un enlace simb&oacute;lico a /var/mail.
 a) Escribir un comando para trasladarse al directorio /var/spool/mail. b)
Escribir  un comando para indicar en qu&eacute; directorio estamos, que responda
con  el nombre del enlace simb&oacute;lico. c) Escribir un comando para indicar
 en qu&eacute; directorio estamos, que responda con el nombre del directorio
 realmente existente (no el enlace simb&oacute;lico). d) &iquest;Cu&aacute;l
 ser&iacute;a el resultado de aplicar los dos comandos anteriores si nos
hall&aacute;ramos  en el directorio /var/mail? (6p).  </li>
   
</ol>
   
<p> </p>
     
<p> </p>
     
<h4> Escribir comandos o interconexiones para realizar las tareas que se indican
(36 puntos):</h4>
     
<ol>
     <li>Listar recursivamente todos los directorios, subdirectorios y archivos,
 en formato largo, bajo el directorio /var/spool/lpd; paginar la salida.<br>
    </li>
    <li>Presentar el contenido del archivo de configuraci&oacute;n del servidor
 de correo, /etc/exim.conf, en p&aacute;ginas de 23 l&iacute;neas y con margen
 de 4 espacios, deteniendo el despliegue en cada pantalla.<br>
    </li>
    <li>Escribir un comando que permita abrir un int&eacute;rprete de comandos
 en la m&aacute;quina remota nautilus.nsk.com.uy.<br>
    </li>
    <li>Listar recursivamente todos los directorios, subdirectorios y archivos 
 visibles e invisibles bajo  el directorio /etc deteniendo el despliegue en
 cada pantalla.</li>
    <li>Trasladarse desde cualquier lugar al directorio propio, a) usando 
una variable de ambiente; b) sin usar una variable de ambiente.</li>
    <li>Invocar el archivo ejecutable<tt> cati </tt>que se encuentra en el 
directorio actual, a) si el directorio actual figura en la variable PATH; 
b) si el directorio actual no figura en la variable PATH.</li>
    <li>Agregar a la variable PATH el directorio actual.</li>
    <li>Mostrar las &uacute;ltimas 20 l&iacute;neas de cada uno de los archivos
 /var/log/smb y /var/log/nmb, uno a continuaci&oacute;n del otro, y paginando
 la salida.<br>
    </li>
    <li>Los archivos viejos de log del sistema se encuentran en el directorio
 /var/log, comprimidos. Sus nombres terminan en ".N.gz", donde N puede  ser
un n&uacute;mero cualquiera. de 0 a 9. Borrar todos los archivos viejos de
log.</li>
    <li>Agregar al archivo ejecutable /usr/local/bin/conex permisos para
que  ejecute como el due&ntilde;o del archivo y como el grupo al que pertenece
 el archivo (SETUID y SETGID).</li>
           <li>Mostrar el c&oacute;digo de error del &uacute;ltimo comando
 ejecutado.</li>
    <li>Actualizar la fecha de los archivos error1, error15, error29 del
directorio  actual.</li>
     
</ol>
  <br>
     <br>
</body>
</html>
